<?php
//1. 算数运算符： + - * / % ++ --

echo 10+20+30; //60

echo "120asdf"+100; //120+100=220

echo "id12"+"8id102"; //0+8=8

echo "<br/>";

echo "12e3sadf"+100; //12000+100=12100

echo true+2; //3

echo  10%3; //余1

$a=10;
$a++;
echo $a; //11

echo "<hr/>";


$a=10;
$b=$a++; //后加加，先将a的赋给变量b，然后自己加加
echo $b; //10

$a=10;
$b=++$a; //先加加，先将a加加后，再赋给变量b
echo $b; //11

echo "<hr/>";

$a=10;
$b = $a+$a++; //11+10=21
echo $b; //21

$a=10;
$b = ++$a+$a; //11+11=22
echo $b; //22


echo "<hr/>";

$a=10;
$b = ++$a+ ++$a; //11+12=23
echo $b;//

